In [89]:
import pandas as pd
import numpy as np

In [90]:
salaries = pd.read_csv("Salary_Data.csv")
salaries.head()

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
0,32.0,Male,Bachelor's,Software Engineer,5.0,90000.0
1,28.0,Female,Master's,Data Analyst,3.0,65000.0
2,45.0,Male,PhD,Senior Manager,15.0,150000.0
3,36.0,Female,Bachelor's,Sales Associate,7.0,60000.0
4,52.0,Male,Master's,Director,20.0,200000.0

In [91]:
print(salaries.isnull().sum())
print("\n")
print(salaries.duplicated().sum())

Age                    2
Gender                 2
Education Level        3
Job Title              2
Years of Experience    3
Salary                 5
dtype: int64


4912

In [92]:
## Handling duplicates ---> Drop Them
salaries_modified = salaries.drop_duplicates()

In [93]:
### Handling Nulls:

## Categorical Null by modes 
## Numerical Null by mean imputation

# Handling Numerical Nulls By Mean Imputation
salaries_modified.loc[:, "Salary"] = salaries_modified["Salary"].fillna(
    round(salaries_modified["Salary"].mean())
)

salaries_modified.loc[:, "Years of Experience"] = salaries_modified["Years of Experience"].fillna(
    round(salaries_modified["Years of Experience"].mean())
)

salaries_modified.loc[:, "Age"] = salaries_modified["Age"].fillna(
    round(salaries_modified["Age"].mean())
)

# Handling Categorical Nulls By Mode Insertion
salaries_modified.loc[:, "Education Level"] = salaries_modified["Education Level"].fillna(
    salaries_modified["Education Level"].mode()[0]
)

salaries_modified.loc[:, "Gender"] = salaries_modified["Gender"].fillna(
    salaries_modified["Gender"].mode()[0]
)

salaries_modified.loc[:, "Job Title"] = salaries_modified["Job Title"].fillna(
    salaries_modified["Job Title"].mode()[0]
)

In [94]:
print(salaries_modified.isnull().sum())
print("\n")
print(salaries_modified.duplicated().sum())

Age                    0
Gender                 0
Education Level        0
Job Title              0
Years of Experience    0
Salary                 0
dtype: int64


0

In [95]:
salaries_modified.head()

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
0,32.0,Male,Bachelor's,Software Engineer,5.0,90000.0
1,28.0,Female,Master's,Data Analyst,3.0,65000.0
2,45.0,Male,PhD,Senior Manager,15.0,150000.0
3,36.0,Female,Bachelor's,Sales Associate,7.0,60000.0
4,52.0,Male,Master's,Director,20.0,200000.0

In [97]:
# Final Step 
salaries_modified.to_csv("Salaries.csv",index=0)